
&НаСервере
Процедура Команда1НаСервере()
	мТабл = Новый Массив;
	мТабл.Добавить("РегистрСведений.адмПериодичностьВыставленияСчетов");
	мТабл.Добавить("РегистрСведений.адмСопоставленныеКонтрагенты");
	мТабл.Добавить("РегистрСведений.пфкДатаНачалаВзаиморасчетов");
	мТабл.Добавить("Справочник.пфкКлиенты");
	мТабл.Добавить("Справочник.пфкАналитика");
	мТабл.Добавить("Справочник.пфкЗадачи");
	мТабл.Добавить("Справочник.пфкПроекты");
	мТабл.Добавить("Справочник.пфкСтатусы");
	мТабл.Добавить("Справочник.пфкНаборыСтатусов");
	мТабл.Добавить("Справочник.пфкНастройкиСоединения");
	мТабл.Добавить("Справочник.пфкФильтрыЗадач");
	мТабл.Добавить("Справочник.пфкФильтрыКлиентов");
	мТабл.Добавить("Справочник.пфкСотрудники");
	
	ОбщееКол = 0;
	Запрос = Новый Запрос;
	Для каждого Таблица Из мТабл Цикл
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КОЛИЧЕСТВО(*) КАК Количество
			|ИЗ
			|	"+Таблица+" КАК Таблица";
		
		Результат = Запрос.Выполнить();
		
		Выборка= Результат.Выбрать();
		
		Выборка.Следующий();
		Сообщить(Таблица+": "+Выборка.Количество);
		ОбщееКол = ОбщееКол + Выборка.Количество;
	КонецЦикла;
	
	Сообщить("Всего записей: "+ОбщееКол);
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
КонецПроцедуры
